Repository: bfavrel/d7_so_feedsagent
Catalog: translations/so_feedsagent.*.po
Languages: fr

source: Include whole criteria definitions
fr: Inclure l'ensemble des définition de critères

source: Include prestataire informations
fr: Inclure les informations du prestataire

source: Create fields for these additional features
fr: Créer des champs pour ces fonctionnalités additionnelles

source: Schedule
fr: Dates programmées

source: A LEI virtual type named '@name' and matching the primary type '@primary' already exists.<br />It's mapped on '@type' Drupal's content type.
fr: Un type virtuel nommé '@name' et correspondant à type primaire '@primary' existe déjà.<br />Il est mappé sur le type Drupal : '@type'.

source: A LEI virtual type named '@name' and matching the primary type '@primary' already exists.<br />Since it's not mapped on any Drupal's content type, it can be redefined.
fr: Un type virtuel nommé '@name' et correspondant à type primaire '@primary' existe déjà.<br />Dans la mesure où il n'est mappé sur aucun type Drupal, il peut être redéfini.

source: Map to virtual type(s)
fr: Mapper sur le(s) type(s) virtuel(s)

source: Produit type
fr: Type de produit

source: Updated
fr: Mis à jour

source: URL clause params
fr: Paramètres de l'URL de la clause

source: 'PVALUES', 'PNAMES', 'leshoraires', etc.<br />Raw format (with &amp;)
fr: 'PVALUES', 'PNAMES', 'leshoraires', etc.<br />Format brut (avec &amp;)

source: Couplages code for "is parent of"
fr: Code de couplage pour "est parent de"

source: Parameters
fr: Paramètres

source: See XML
fr: Voir le XML

source: Server didn't return any XML data (rfom=@rfrom, rto=@rto)
fr: Le serveur n'a retourné aucune donnée XML (rfom=@rfrom, rto=@rto)

source: Server didn't respond (rfom=@rfrom, rto=@rto)
fr: Le serveur n'a pas répondu (rfom=@rfrom, rto=@rto)

source: XML was empty (rfom=@rfrom, rto=@rto)
fr: Le XML était vide (rfom=@rfrom, rto=@rto)

source: Feed is invalid. One or more parameters missing : @missing
fr: Le flux est invalide. Un ou plusieurs paramètres sont manquants : @missing

source: Server didn't provide any XML data
fr: Le serveur n'a fourni aucunes données XML

source: XML was empty
fr: Le fichier XML était vide

source: No title
fr: Sans titre

source: 1 virtual type has been set
fr: 1 type virtuel a été paramétré

source: Define and map a LEI virtual type
fr: Définir et mapper un type virtuel LEI

source: LEI connector
fr: Connecteur LEI

source: Use
fr: Utiliser

source: Mapping parameters
fr: Paramètres de mappage

source: Map from orphan virtual type
fr: Mapper à partir d'un type virtuel orphelin

source: no
fr: non

source: Drupal type mapping target
fr: Type Drupal cible

source: create a new one
fr: en créer un nouveau

source: LEI data
fr: Données LEI

source: Fields to unionize
fr: Champs à syndiquer

source: Fields definitions and mappings
fr: Définition des champs et mappages

source: 'Title' parameter : if one or more values have been set in feed/connector, they can be overridden partially or totally, with correct index assignement.
fr: Paramètre 'Titre' : si une ou plusieurs valeurs ont été définies dans le flux/connecteur, celles-ci peuvent être supplantées en tout ou partie, avec un assignement correct des indexes.

source: Media params
fr: Paramètre des médias

source: Drupal new node type params
fr: Paramètres du nouveau type Drupal

source: Edit an LEI virtual type
fr: Editer un type virtuel LEI

source: Edit virtual types which use
fr: Editer les types virtuels qui utilisent

source: Virtual type
fr: Type virtuel

source: Duplicate existing LEI type parameters on one or more orphan virtual types
fr: Dupliquer les paramètres d'un type LEI existant sur un ou plusieurs types virtuels orphelins

source: Source type
fr: Type source

source: Map from virtual type
fr: Mapper à partir du type virtuel

source: Target type(s)
fr: Type(s) cible(s)

source: Operation completed
fr: Opération achevée

source: Interface between FeedsAgent and the LEI. Implements the content type generator and content importer functionalities.
fr: Interface entre FeedsAgent et le LEI. Implémente les fonctionnalités de génération de types de contenu ainsi que d'importation de contenus.

source: File was found. Last update : @date at @time.
fr: Le fichier a été trouvé. Dernière mise à jour : @date à @time.

source: FILE WAS NOT FOUND !
fr: LE FICHIER N'A PAS ETE TROUVE !

source: After saving, check here to see if file is found.
fr: Après sauvegarde, vérifiez ici que le fichier a été trouvé.

source: Media contents base URL
fr: Base URL des contenus MEDIA

source: Data import
fr: Import de données

source: Import script path
fr: Chemin du script d'import

source: Values separator
fr: Séparateur de valeurs

source: Import filters
fr: Filtres d'import

source: overridable in each feeds
fr: supplantable dans chaque flux

source: One condition per line. Relation between conditions : 'OR'. Format : [field][operator (either '=', '!=', '~' or '!~')][value].<br />Exemple : "zoneOT~OT Périgueux", "categorie!=Excursion en autocar"
fr: Une condition par ligne. Relation entre les conditions : 'OR'. Format : [champ][opérateur (soit '=', '!=', '~' ou '!~')][valeur].<br />Exemple : "zoneOT~OT Périgueux", "categorie!=Excursion en autocar"

source: A Tourinsoft virtual type named '@name' and matching the primary type '@primary' already exists.<br />It's mapped on '@type' Drupal's content type.
fr: Un type virtuel Tourinsoft nommé '@name' correspondant au type primaire '@primary' existe déjà.<br />Il est mappé sur le type Drupal '@type'.

source: A Tourinsoft virtual type named '@name' and matching the primary type '@primary' already exists.<br />Since it's not mapped on any Drupal's content type, it can be redefined.
fr: Un type virtuel Tourinsoft nommé '@name' correspondant au type primaire '@primary' existe déjà.<br />Dans la mesure où il n'est mappé sur aucun type Drupal, il peut être redéfini.

source: Created
fr: Créé(e)

source: Server didn't provide any listing XML data
fr: Le serveur n'a fourni aucune donnée XML de listing

source: Server didn't provide any fiche XML data
fr: Le serveur n'a fourni aucune donnée XML de fiche

source: Define and map a Tourinsoft virtual type
fr: Définir et mapper un type virtuel Tourinsoft

source: Tourinsoft connector
fr: Connecteur Tourinsoft

source: Tourinsoft data
fr: Données Tourinsoft

source: Edit a Tourinsoft virtual type
fr: Editer un type virtuel Tourinsoft
