Repository: bfavrel/d7_so_feedsagent
Catalog: translations/so_feedsagent.*.po
Languages: fr

source: Display FeedsAgent data elements.
fr: Affiche des éléments de données de FeedsAgent.

source: Coupled items
fr: Fiches couplées

source: Display associated items.
fr: Affiche les fiches couplées.

source: This item is a child of this item
fr: Cette fiche est un enfant de cette fiche

source: This item is the parent of these items
fr: Cette fiche est le parent de ces fiches

source: Default
fr: Par défaut

source: Label for parent
fr: Label pour les fiches parent

source: In default language
fr: En langage par défaut

source: Label for childs
fr: Label pour les fiches enfants

source: View mode used to display items
fr: View mode utilisé pour afficher la fiche

source: FeedsAgent content type wizard
fr: Wizard FeedsAgent

source: Operations
fr: Actions

source: Content type : '@type'
fr: Type de contenu : '@type'

source: Connector : '@connector'
fr: Connecteur : '@connector'

source: Virtual name : '@virtual_name'
fr: Nom virtuel : '@virtual_name'

source: Primary type : '@primary_type'
fr: Type primaire : '@primary_type'

source: Previous
fr: Précédent

source: Finish
fr: Terminer

source: Next
fr: Suivant

source: At least a connector must be created first : <br />!link
fr: Un connecteur doit avoir été créé au préalable

source: create a connector
fr: Créer un connecteur

source: Connector
fr: Connecteur

source: Primary type
fr: Type primaire

source: none
fr: aucun(e)

source: Drupal type
fr: Type Drupal

source: The present virtual type will be mapped on '@type' type.
fr: Le type virtuel sera mappé sur le type '@type'

source: Human readable name
fr: Nom

source: Machine name
fr: Nom système

source: The node type '@type' ('@label') already exists.
fr: Le type de node '@type' ('@label') existe déjà.

source: Node type '@type' has been created
fr: Le type de node '@type' a été créé

source: Node type '@type' has been edited
fr: Le type de node '@type' a été édité

source: Because of node type remapping
fr: A cause du remappage de type de node

source: Report
fr: Rapport

source: undefined
fr: indéfini

source: Legend
fr: Légende

source: Used in the virtual type
fr: Utilisé dans le type virtuel

source: Used in the Drupal's type
fr: Utilisé dans le type Drupal

source: Used in the connector
fr: Utilisé dans le connecteur

source: Unionize
fr: Syndiquer

source: Field label
fr: Label du champ

source: System name
fr: Nom système

source: Type family
fr: Famille du type

source: Locked
fr: Verrouillé

source: virtual type
fr: Type virtuel

source: Drupal's type
fr: Type Drupal

source: connector
fr: connecteur

source: Existing mappings in connector
fr: Mappages existants dans le connecteur

source: Create new field or map on existing non-SFA one
fr: Créer un nouveau champ ou mapper sur un existant non-SFA

source: Current mapping
fr: Mappage courant

source: Possibly compatible fields in @typeof
fr: Champs éventuellement compatibles dans le @typeof

source: New fields
fr: Nouveaux champs

source: These params are inherited from connector's settings but can be overridden here.
fr: Ces paramètres sont hérités de ceux du connecteur, mais peuvent être outrepassés ici.

source: Weight
fr: Poids

source: Title
fr: Titre

source: Label
fr: Étiquette

source: Drupal field mapping
fr: Mappage de champ Drupal

source: 1 new field has been defined
fr: 1 nouveau champ a été défini

source: 1 new group has been defined
fr: 1 nouveau groupe a été défini

source: 1 field has been instantiated
fr: 1 champ a été instancié

source: 1 feed field has been registered
fr: 1 champ a été enregistré

source: 1 node has been deleted
fr: 1 nodes a été supprimé

source: Importer : <br />Queue : @id<br />Creation : @created<br />Last try : @retried<br />Total tries : @tries
fr: Importer : <br />Queue : @id<br />Creation : @created<br />Dernière tentative : @retried<br />Tentatives totales : @tries

source: configure
fr: configurer

source: delete
fr: supprimer

source: update
fr: mettre à jour

source: import
fr: importer

source: Feed informations
fr: Paramètres du flux

source: Not configured yet
fr: Pas encore configuré

source: Save
fr: Enregistrer

source: Name
fr: Nom

source: Don't add language information : it will be specified everywhere it's needed.
fr: Ne pas ajouter d'information de langue : elle sera automatiquement spécifiée là où c'est nécessaire.

source: Language
fr: Langue

source: Add
fr: Ajouter

source: Based on feed
fr: Basé sur le flux

source: Feed to copy parameters from.
fr: Flux à partir duquel copier les paramètres

source: None
fr: Aucun(e)

source: Configuration has been saved
fr: La configuration a été sauvegardée

source: !name field is required.
fr: Le champ !name est requis.

source: Feed created.<br />It has to be configured now :
fr: Le flux a été créé.<br />Il doit maintenant être configuré :

source: Are you sure you want to delete the feed '@feed' ?
fr: Êtes-vous sûr de vouloir supprimer le flux '@feed' ?

source: Delete
fr: Supprimer

source: '@feed' feed configuration
fr: Configuration du flux '@feed'

source: Back
fr: Retour

source: Basic parameters
fr: Paramètres de base

source: Active
fr: Actif

source: Inactive feeds will be discarded from updates.
fr: Les flux inactifs sont ignorés lors des mises à jours.

source: Update periodicity
fr: Periodicité des mises à jour

source: Cron mode
fr: Mode du cron

source: During next update, feed's items must be updated, regardless their last update date.
fr: Durant la prochaine mise à jour, les fiches du flux doivent être mises à jour, sans tenir compte de la date de leur dernière mise à jour.

source: This parameter will be automatically reseted after successful update
fr: Ce paramètre sera automatiquement réinitialisé après la réussite de la mise à jour.

source: Default title field
fr: Champ de titre par défaut

source: As it appears in data source.<br />Several fields can be set (separated by commas). They will be processed in order, until a title is found.
fr: Sous la forme exacte où il apparaît dans la source de données.<br />Plusieurs champs peuvent être spécifiés (séparés par des virgules). Ils seront traités dans l'ordre, jusqu'à ce qu'un titre soit trouvé.

source: These setting can be overriden in each content type.
fr: Ces paramètres peuvent être outrepassés dans chaque type de contenu.

source: Update FeedsAgent's contents
fr: Mettre à jour les contenus FeedsAgent

source: No feed was created.
fr: Aucun flux disponible

source: launched by @username (@datetime)
fr: lancé par @username (@datetime)

source: One or more updates are already running
fr: Une ou plusieurs mises à jour sont déjà en cours

source: Updates consume a lot of server ressources. Launch several updates in the same time may put the site down.
fr: Les mises à jour consomment énormément de ressources serveur. En lancer plusieurs en même-temps est susceptible de crasher le serveur.

source: If you note this situation lasts an unreasonable time, that probably means a problem happens during update and the update system is frozen.
fr: Si vous remarquez que cette opération dure un temps anormalement long, cela signifie probablement qu'un problème est survenu durant la mise à jour, et que le système de mise à jour est bloqué.

source: Feel free to contact the Technical Support
fr: Dans ce cas, merci de contacter le support technique.

source: Currently processed
fr: En cours de traitement

source: Update@feed
fr: Mise à jour@feed

source: Periodic update@feed
fr: Mise à jour périodique@feed

source: Import@feed
fr: Importation@feed

source: @op of '@feed' feed (@id)
fr: @op du flux '@feed' (@id)

source: Connector didn't return any listing XML data
fr: Le connecteur n'a retourné aucune donnée XML de listing

source: The virtual content type '@type' referenced under primary type '@primary' was created
fr: Le type de contenu virtuel '@type' référencé par le type primaire '@primary' a été créé

source: No node was created, imported or updated.
fr: Aucun node n'a été créé, importé ou mis à jour.

source: Calling feed's server an preparing data
fr: Appel du server de flux et préparation des données

source: Processing node @current out of @total
fr: Traitement du node @current sur @total

source: @op of '@feed' feed
fr: @op du flux '@feed'

source: Deletion
fr: Suppression

source: Feed '@feed' has been deleted.
fr: Le flux '@feed' a été supprimé.

source: @op of feed '@feed'
fr: @op du flux '@feed'

source: An error occurs while saving new node matching item '@item' : <br />@data
fr: Une erreur est survenue lors de la sauvegarde du nouveau node correspondant à la fiche '@item' : <br />@data

source: Node was created and published (node type : '@type')
fr: Le node a été créé et publié (type de node : '@type')

source: An error occurs while creating node matching item '@item'
fr: Une erreur est survenue lors de la création du node correspondant à la fiche '@item'

source: Item was up to date
fr: La fiche était à jour

source: Node '@nid', in feed '@feed', was supposed to be part of Drupal's type '@old_drupal_type' but it's now appears to be part of SFA's type '@new_sfa_type' which is mapped on Drupal's type '@new_drupal_type'.<br />Node has been deleted.
fr: Le node '@nid' du flux '@feed' était supposé être du type Drupal '@old_drupal_type' seulement, il apparaît maintenant comme faisant partie du type SFA '@new_sfa_type' qui, lui, est mappé sur le type Drupal '@new_drupal_type'.<br />Le node a été supprimé.

source: Some errors hapend during update. See logs for further details.
fr: Des erreurs se sont produites durant la mise à jour. Veuillez consulter les logs pour de plus amples détails.

source: Item was existing again in feed. It has been republished.
fr: La fiche est réapparue dans le flux. Elle a été republiée.

source: Item was existing again in feed. It has been left unpublished.
fr: La fiche est réapparue dans le flux. Elle a été laissé non-publiée.

source: An error has occured.
fr: Une erreur est survenue.

source: Node '@nid', in feed '@feed', is supposed to be part of Drupal's type '@old_drupal_type' but it's now appears to be part of SFA's type '@new_sfa_type' which is mapped on Drupal's type '@new_drupal_type'.<br />Node has to be deleted.
fr: Le node '@nid' du flux '@feed' était supposé être du type Drupal '@old_drupal_type' seulement, il apparaît maintenant comme faisant partie du type SFA '@new_sfa_type' qui, lui, est mappé sur le type Drupal '@new_drupal_type'.<br />Le node doit être supprimé.

source: manual update of item
fr: mise à jour manuelle de la fiche

source: An error has occured. Values have not been updated from feed.<br /> See below for details.
fr: Une erreur est survenue. Les valeurs n'ont pas été mises à jour à partir du flux.<br />Voir ci-dessous pour les détails.

source: Values has been updated from feed
fr: Les valeurs ont été mises à jour.

source: Update '!title' from feed
fr: Mise à jour de '!title' à partir du flux

source: Lauch update
fr: Lancer la mise à jour

source: Fiche ID
fr: ID de la fiche

source: SFA id
fr: id SFA

source: This node is provided by these feeds
fr: Ce node est fourni par ces flux

source: Coupling
fr: Couplage

source: Data are out of date !
fr: Les données ne sont pas à jour !

source: The last successful update took place on @date at @time @type.
fr: La dernière mise à jour réussie a eu lieu le @date à @time @type

source: No successful item update has been recorded yet.
fr: Aucune mise à jour réussie n'a été enregistrée pour le moment.

source: On @date at @time @type
fr: Le @date à @time @type

source: During last successful update, one or more minor problems have been detected
fr: Lors de la dernière mise à jour, un ou plusieurs problèmes sans gravité ont été détectés

source: Node's diary
fr: Journal du node

source: Error
fr: Erreur

source: Query
fr: Requête

source: Unknown error. See watchdog for further details.
fr: Erreur inconnue. Consulter le watchdog pour les détails.

source: by @user
fr: par @user

source: Node was successfully updated
fr: Le node a été mis à jour avec succès

source: Update failed
fr: La mise à jour a échoué

source: by @username
fr: par @username

source: Inactive
fr: Inactif

source: Restart
fr: Relancer

source: Cancel
fr: Annuler

source: Batches' current activity
fr: Activité courante des batches

source: Batch's elapsed time is updated each time a new item is processed.
fr: Le temps passé du batch est mis à jour dès qu'une nouvelle fiche est traitée.

source: If values remain unchanged during a long time, that probably means the operation has crashed.
fr: Si la valeur demeure inchangée durant un temps anormalement long, cela signifie probablement que l'opération a crashé.

source: Using 'restart' operation while a batch is already running starts a parallel batch (two more items processed in the same time).
fr: Utiliser l'opération 'Relancer' alors qu'un batch est déjà en cours de traitement démarrera le même batch en parallèle (deux fois plus de fiches a traiter dans le même temps).

source: That's not a real problem (if server's CPU is ok), but when second batch will finish, the first one will be frozen (but all items will have been processed).
fr: Cela ne constitue pas un réel problème (dans la mesure où le CPU le supporte), toutefois, quand le second batch s'achèvera, le premier sera bloqué (mais toutes les fiches auront été traitées).

source: Current operation
fr: Opération en cours

source: State
fr: Etat

source: Started
fr: Démarré

source: Elapsed time
fr: Temps écoulé

source: Processed
fr: Traité

source: Currently, no activity has been detected.
fr: Actuellement, aucune activité n'a été détectée.

source: Batch has been canceled
fr: Le batch a été annulé

source: node was relegated at bottom of listing
fr: le node a été relégué en fin de listing

source: since node was existing in several feed, no action was performed
fr: dans la mesure où le node existait dans plusieurs flux, aucune action n'a été prise

source: node was unpublished
fr: le node a été dépublié

source: node was deleted
fr: le node a été supprimé

source: Item was no longer exist in feed.
fr: La fiche n'existait plus dans le flux.

source: Action taken
fr: Action prise

source: An unknown error occurred while processing item : '@item'.<br />Reference of the batch : '@batchid'
fr: Une erreur inconnue s'est produite, lors du traitement de cet fiche : '@item'.<br />Référence du traitement : '@batchid'

source: Hourly@fai
fr: Horaire@fai

source: Daily@fai
fr: Journalière@fai

source: Weekly@fai
fr: Hebdomadaire@fai

source: Monthly@fai
fr: Mensuelle@fai

source: No feed set yet
fr: Aucun flux paramétré

source: Periodicity
fr: Périodicité

source: Forced
fr: Forcé

source: Warnings
fr: Alertes

source: Error hapend during update : <br />@data
fr: Une erreur est survenue durant la mise à jour : <br />@data

source: One feed is currently in error state
fr: Un flux est actuellement en état d'erreur

source: 1 node created
fr: 1 node a été créé

source: 1 node was up to date
fr: 1 node était à jour

source: 1 node was updated
fr: 1 node a été mis à jour

source: 1 node was (re)imported
fr: 1 node a été (ré)importé

source: 1 obsolete node was left untouched
fr: 1 node obsolète est demeuré inchangé

source: 1 obsolete node was relegated
fr: 1 node a été relégué

source: 1 obsolete node was removed from feed
fr: 1 node obsolète a été retiré du flux

source: 1 obsolete node was unpublished
fr: 1 node obsolète a été dépublié

source: 1 obsolete node was deleted
fr: 1 node obsolète a été supprimé

source: Administer FeedsAgent
fr: Administrer FeedsAgent

source: Configure module's params, create connectors and feeds, and launch imports.
fr: Configurer le module, créer des connecteurs et des flux, et lancer des imports.

source: Use FeedsAgent Generator
fr: Utiliser FeedsAgent Generator

source: Create or edit content types.
fr: Créer ou éditer des types de contenus.

source: Use FeedsAgent Importer
fr: Utiliser FeedsAgent Importer

source: Enable/disable feeds, set periodicities and lauch updates.
fr: Activer/désactiver des flux, régler les périodicités et lancer des mises à jour.

source: General settings, connectors, and feeds
fr: Paramètres généraux, connecteurs, et feeds

source: FeedsAgent general settings
fr: Paramètres globaux de FeedsAgent

source: Widgets default options
fr: Options par défaut des widgets

source: These settings can be overriden in each connector and in each content type.
fr: Ces paramètres peuvent être outrepassés dans chaque connecteur, puis dans chaque type de contenu.

source: Schedules
fr: Programmations

source: Activate cron updates
fr: Activer le cron des mises à jour

source: Day of month for monthly cron
fr: Jour du mois pour le cron mensuel

source: Day of week for weekly cron
fr: Jour de la semaine pour le cron hebdomadaire

source: From 1 (monday) to 7 (sunday)
fr: De 1 (lundi) à 7 (dimanche)

source: Time window for monthly, weekly and daily cron
fr: Fenêtre horaire pour les crons mensuels, hebdomadaires et journaliers

source: Two hours, separated by '-'.<br />Exemple : '0-6' = "between 0h00 (included) and 06h00 (not included)".
fr: Deux heures, séparées par '-'.<br />Exemple : '0-6' = "entre 00h00 (inclus) et 06h00 (non inclus)"

source: Default behaviors
fr: Comportements par défaut

source: These settings can be overriden in each connector and in each feed.
fr: Ces paramètres peuvent être outrepassés dans chaque connecteur, puis dans chaque flux.

source: keep only the last
fr: conserver seulement les

source: events
fr: derniers événements

source: Content types
fr: Types de contenu

source: Action to take when an unknown content type is found in a feed
fr: Que faire quand un type de contenu inconnu est rencontré dans un flux ?

source: Ignore
fr: L'ignorer

source: Create a virtual content type
fr: Créer un type de contenu virtuel

source: Nodes
fr: Nœuds

source: Action to take when a feed node no longer exists in a feed
fr: Que faire quand un node de flux n'existe plus dans ce flux ?

source: Unpublish (only if it exists in one feed)
fr: Le dépublier (seulement s'il n'existe que dans un seul flux)

source: Delete (only if it exists in one feed)
fr: Le supprimer (seulement s'il n'existe que dans un seul flux)

source: Relegate it to the end of the feed's contents
fr: Le réléguer à la fin de la liste des contenus du flux

source: Action to take when an unpublished node exists in a feed
fr: Que faire lorsqu'un node dépublié existe dans un flux ?

source: Publish and possibly restore his weight
fr: Le publier et, si besoin, restaurer son poids

source: Existing node's title must be updated only if it's empty
fr: Le titre d'un node, s'il est paramétré, ne doit plus être mis à jour

source: Folder
fr: Dossier

source: Without trailing slash
fr: Sans le slash de fin

source: Default image
fr: Image par défaut

source: File
fr: Fichier

source: Connector type
fr: Type de connecteur

source: Connector created.<br />It has to be configured now :
fr: Le connecteur a été créé.<br />Il doit maintenant être configuré :

source: Are you sure you want to delete the connector '@connector' ?
fr: Êtes-vous sûr de vouloir supprimer le connecteur '@connector' ?

source: Connector '@connector' has been deleted
fr: Le connecteur '@connector' a été supprimé

source: '@connector' connector configuration
fr: Configuration du connecteur '@connector'

source: Connector params
fr: Paramètres du connecteur

source: Widgets options
fr: Options des widgets

source: These params are inherited from FeedsAgent general settings but can be overridden here.
fr: Ces paramètres sont hérités des paramètres généraux de FeedsAgent, mais peuvent être outrepassés ici.

source: These setting can be overriden in each feed and in each content type.
fr: Ces paramètres peuvent être outrepassé dans chaque flux, et dans chaque type de contenu.

source: Behaviors
fr: Comportements

source: Undefined
fr: Indéfini

source: Custom
fr: Personnalisé

source: Textfield
fr: Champ texte

source: text
fr: texte

source: Textarea
fr: Zone de texte

source: Number integer
fr: Nombre entier

source: integer
fr: entier

source: Number decimal
fr: Nombre décimal

source: decimal
fr: décimal

source: Select list
fr: Liste de sélection

source: unique selection
fr: sélection unique

source: Radios buttons
fr: Boutons radios

source: Checkboxes
fr: Cases à cocher

source: multiple selection
fr: sélection multiple

source: Checkbox (on/off)
fr: Case à cocher (on/off)

source: boolean
fr: booléen

source: url/image/file
fr: url/image/fichier

source: default
fr: défaut

source: Nodes in feed
fr: Nodes du flux

source: Regroup childs items with their parents.
fr: Regrouper les fiches enfants avec leurs parents.

source: If not checked parents and childs items will appear in listings each as a standalone item.
fr: Si non coché, les fiches parents et enfant apparaîtront chacune dans le listing comme des fiches distinctes.

source: If checked only parents items will appear, though search results take also childs items' data in account.
fr: Si coché, seuls les fiches parent apparaîtront, bien que les résultats de recherchent prennent également en compte les données des fiches enfants.

source: Sorting by feed listing order
fr: Trier par ordre des fiches du flux

source: No connector set yet
fr: Aucun connecteur pour le moment

source: override on
fr: Activer la supplantation

source: Click here to override feed's values
fr: Cliquer ici pour supplanter les valeurs de ce champ

source: override off
fr: Désactiver la supplantation

source: Click here to remove feed's values override
fr: Cliquer ici pour restaurer les valeurs du serveur

source: Field '@field' has been removed from FeedsAgent content type '@virtual_name'
fr: Le champ '@field' a été supprimé du type FeedsAgent '@virtual_name'

source: Group '@group' has been removed from FeedsAgent content type '@virtual_name'
fr: Le groupe '@group' a été supprimé du type FeedsAgent '@virtual_name'

source: Feedsagent type(s) mapping
fr: Mappage des types FeedsAgent

source: Node type mapped from
fr: Type de node mappé à partir de

source: Unionized in
fr: Syndiqué dans

source: Update started : @type
fr: Début de la mise à jour : @type

source: Feeds processed : @feed
fr: Flux traité : @feed

source: Update finished
fr: Mise à jour terminée

source: Connectors
fr: Connecteurs

source: Feeds
fr: Flux

source: Summary
fr: Résumé

source: Table '@table' has been dropped
fr: La table '@table' a été supprimée

source: Table '@table' has been created
fr: La table '@table' a été créée

source: Table '@table' has been altered
fr: La table '@table' a été altérée

source: Field '@field' has been added
fr: Le champ '@field' a été ajouté

source: Provides tools for content types creation and contents importation from various feeds.
fr: Fourni des outils de création de types de contenus et d'importation de contenus en provenance de divers flux.

source: Without trailing slash.
fr: Sans le slash de fin.

source: Base URL
fr: URL de base

source: User
fr: Utilisateur

source: Key
fr: Clef

source: Schema
fr: Schéma

source: URL params
fr: Paramètres d'URL

source: Raw format (with &amp;)
fr: Format brut (avec &amps;)

source: Listing section max length
fr: Longueur maximum des tronçons de listings

source: 0 = unlimited
fr: 0 = pas de limite

source: Produit ID
fr: ID du produit

source: To use as reference
fr: A utiliser comme référence

source: Use an input mask
fr: Utiliser un masque de saisie

source: Input mask
fr: Masque de saisie

source: URL starting with : 'http://'.<br />Format : listeproduits.asp?rfrom=1&rto=1&user=<em>[user]</em>&pwkey=<em>[key]</em>&urlnames=tous&lepool=<em>[pool]</em>
fr: URL commençant par : 'http://'.<br />Format : listeproduits.asp?rfrom=1&rto=1&user=<em>[user]</em>&pwkey=<em>[key]</em>&urlnames=tous&lepool=<em>[pool]</em>

source: Content type fields
fr: Champs du type de contenu
